{
	"content": [
				{
			"section": "relationships",
			"type": "opinion",
			"title": "Conventional dating is stupid",
			"text": "I hate how couples label their meaningless phases of interaction: 'we're talking' or 'we're texting' and then 'we're dating'. Once they start dating, monthly anniversaries are celebrated. In some cases I've even seen weekly anniversaries celebrated with GIFTS. Seriously, what the fuck is that shit?! Then, these couples have certain criteria for texting. My boyfriend needs to text me every night a good night text. Or, more criteria like: I can't look at another girl my girlfriend will kill me. Some of y'all make up TOO MANY stupid ass RULES for dating. It's about connecting with a person. Stop with the labels and the regulations like you're a communist nation or some shit…Toxic relationships are not a thing I hear people, mostly women, speaking about how they broke up with their s.o. because the relationship was toxic. But what that really means is that one or both of the people in the relationship are behaving in a toxic manner. A relationship is not its own entity. It cannot be inherently toxic without actions taken from the individuals So basically to me it just sounds like a way to absolve yourself of responsibility. As in, you are one half of this relationship, if the relationship is 'Toxic then you are at least half of the reason for that, not the relationship, you. Breaking up with your s.o. will not lead to a healthier relationship if you are not willing to accept your part of the blame for why the relationship is not working. So stop with this vacuous 'The relationship was just toxic' bullshit. You are a 'toxic' (I don't really like that term) person, poisoning your relationship and telling yourself it was not your fault, as the relationship itself was toxic. When everyone knows that is not true."
		}, 
		{
			"section": "relationships",
			"type": "opinion",
			"title":"Kids ruin relationships",
			"text":"I plan on never having children, and luckily for me, my girlfriend agrees. Every divorce I've seen is always after children. Kids put too much pressure on you. They're expensive, annoying, and take time away from being with your loved one. They're constantly with you, holding back your sex life. They ruin relationships. I want a good future with my girlfriend, not a shitty one held back by children in my house."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "Saying 'Significant other' is stupid",
			"text": "Everytime someone shorthands it online as SO I instantly think it means superior officer. It's so stupid. Wish people would just say boyfriend/girlfriend/partner instead."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "Romantic relationships are NOT enjoyable.",
			"text": "I'm not trying to be a pessimist. It's just... the media has made it seem like romance equals happiness. I just don't understand it.In my experience, relationships are quite sad. There'"
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "There is absolutely nothing wrong with promiscuity or having polyamorous ",
			"text": "This is assuming the person(s) engaging in casual sex or in a polyamourous relationship is taking the appropriate measures to protect against STDs or pregnancy. Why must people belong to a two person relationship or why must people have a relationship at all even if they clearly have sexual needs? Sex is not this 'mystical' thing that is somehow better if you do it with someone who you have an exclusive relationship with. Some people might be more into it if they love their partner but many people do not give the slightest fuck about that and love sex for sex. Anyways, as long what people are doing does not threaten others, why is doing what they enjoy such a bad thing? Furthermore, why does there remain such a greater stigma towards women who are promiscuous? They are no different as a person than a woman who practices monogamy, they just have a different preference for how things work when they want to have fun. People really need to stop fucking judging others for the harmless actions of those just trying to have fun."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "I don't understand the taboo of talking about past relationships with new partners",
			"text": " It seems like there's this giant prohibition on any in-depth discussion of ex-lovers with new ones and I think it's just silly. Obviously it wouldn't be appropriate for the first few dates, but it's almost like any amount of discussion of previous romantic partners is met with the assumption that you're not over it, you have major emotional baggage, and you're the jealous type who's going to stalk the ex’s. But me? I dunno; I genuinely enjoy talking about relationships and I don't see the harm in getting the details out in the open. I think it's fun and interesting and it teaches you a lot about another person. Why do we have to pretend our ex's are completely irrelevant? It just seems strange to me."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "If you're a single parent, you should leave the dating pool for 18 years, or until your kid/s are out of the house.",
			"text": "You fucked up. Your dating life is over. As a fit mid 20s male, I would never date someone with kids. I doubt I'll change my mind in my 30s or 40s. I assume everyone who is not a blob has similar opinions."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "Some people deserve to be alone",
			"text": "If you're a pathetic sad sack who spends all day whining about how pathetic and sad you are and how you'll never get a relationship or sex, you deserve to be alone. Who is going to choose to spend their limited time on this earth with someone who's such a fucking downer? If everything you write or say sounds like a suicide note, no one is going to want to be your friend. Get some therapy, get some meds, just fucking do something instead of sitting around a circle-jerky sub telling each other how pathetic you all are."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "You should listen to your jealousy",
			"text": "Ok this is going to come off harsh... Anyhow jealousy is a very smart emotion. When your gut is telling you your girlfriend might cheat on you, she might actually cheat on you, simply because she can. Unless she's in a vegetative state and physically incapable to cheat, you can never know for sure. You see, jealousy is there to protect you. It doesn't necessarily mean you're insecure. Sometimes it just means you're intelligent. There's sexual cheating, then there's emotional cheating. And there's attention cheating. And infinite other kinds of cheating, because what qualifies as cheating varies from person to person. That is precisely why you should always, ALWAYS set the boundaries right in the beginning of the relationship. Yes, I am quite aware that there are people who are totally okay with any extra-relational behavior. Good for them. Jealousy should help you set boundaries for your partner. You DO have a right to tell them what they can and can't do. If they really are trustworthy they will respect the boundaries you set and if they value the relationship they should be attentive to your needs. Someone who's in a relationship should take what they're doing into consideration at all times. Only ever feel secure in a relationship when you know that it is secure."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": " I'm not attracted to very beautiful girls.",
			"text": "I don't mean like above average pretty girls you'd definitely like to sleep with, i'm talking about very modelesque big breasted, hourglass figured, long haired, blue eyed beauty that everyone seems to flip the hell out over. They just seem like cookie cutter conveyor belt women who don't even exist outside of tv. Maybe it's because I know they're out of my league lol, but seriously, if given the opportunity I'd pick the girls in my dating range any day simply for the fact that I'd feel like a fucking slug waking up next to someone like that every day. Give me a 5'0' short haired average girl with pretty eyes and a decent body any day and I'd be a happy man."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "Interracial Dating is not cool",
			"text": "Staying within your race will alleviate so much BS so why do it? I'm 1/2 of an interracial marriage and I've experienced it in the west and the east and I wouldn't wish the hardship on anyone."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "Fuck online dating.",
			"text": "I am awful tired of online dating. Can we stop shopping for a partner like we're shopping for a car and just hang out and get to know each other a bit? I'm sick of the word 'dealbreakers.' How about you get to know someone before you put on your judgey pants. Stop viewing everyone you meet through a filter of 'the ideal partner' and just enjoy someone's company for five minutes. No, I don't consider 'doesn't like football,' or 'isn't willing to give me kids right away,' to be valid 'dealbreakers.' No I'm not gonna marry you and give you babies just because you're pretty. You better be prepared to earn that shit, because if your highest ambition is 'to become a mother,' then you're already boring me. Not that there's anything wrong with that ambition, and I'm not going to judge or dismiss you for doing things that bore me. Both men and women these days come to the first date with a laundry list of attributes they expect, and if you don't get enough checks on that checklist, you better just check out mister. We're all human beings, y'all, this isn't a damn car dealership. If you're open minded you might even find out you like someone. And, yeah, I like an ambitious woman, yeah I prefer a chubby body type, but no I don't make those absolute requirements to get to know me. Maximum frustration! Oh, and guess what. If you're a 30+ year old woman with no goals, no passions, working at the corner store, and living with your parents then it turns out you're not too good to talk to me you fucking loser. To be clear, I'm not calling out any one person here; this just seems to be a trend. Yeah, life is hard; I worked my ass off to get to where I am today, and I never could have done it without my parents' support. I understand the struggle, but get off your high fuckin' horse and give a man a chance before you decide he's not good enough to even talk to."
		},
		{
			"section": "relationships",
			"type": "opinion",
			"title": "Tinder is not for men.",
			"text": "I have not used Tinder in over a year and for good reason. I've never had trouble meeting girls or finding dates. Tinder seemed like a great way to streamline dating. Instead of trying to find single girls to date in public I now had an app and everyone on it was single. Wow, was I naive in assuming that there would just be an app full of wonderful, selfless people lining up to split the cost of meals and entertainment. I went on probably 50 dates with about 15 girls or so. Not one of these girls offered to split the cost of anything ever. I usually ask on the second date if the girl wants to split it and all of them had some well crafted way of getting out of paying their share. Some of the girls straight up told me they thought the man should pay for things, others told me they found it unattractive that I would ask, several just kind of gave me a dirty look. Half of these girls had been on some big vacation in the last few months or so which is just odd because none of them had very good jobs that would afford them international vacations. After a while it occurred to me that most of these girls basically never paid for anything in their lives and Tinder was just a way to get free food every day or find a guy to take them on a vacation that they wouldn't pay for. It's been over a year since I used Tinder and I still have not recovered my faith in humanity. Tinder is cancer!"
		},
		{
			"section": "relationships",
			"type": "quote",
			"title": "Both men and women keep repeating the same dating mistakes while they’re not getting any younger.",
			"text": ""
		},
		{
			"section": "relationships",
			"type": "quote",
			"title": "I don’t believe in living together before marriage.",
			"text": ""
		},
		{
			"section": "relationships",
			"type": "quote",
			"title": "You shouldn't worry if you’re being friendzoned",
			"text": ""
		},
		{
			"section": "relationships",
			"type": "quote",
			"title": "Getting to know someone well’ is a bit overrated.",
			"text": ""
		},
		{
			"section": "relationships",
			"type": "article",
			"title": "It’s Totally Okay To Be Clingy In Relationships",
			"text": "If you google the phrase 'clingy in a relationship', pretty much 9 out of 10 search results will come up with a negative, dismissive tone while the remaining 1 is probably urban dictionary explaining what clingy means. <br/> 'Clingy' has long been deemed as one of the most undesirable traits that could instantly turn off any level of interest. It’s the bomb you drop on the first date if you want to send any dating prospect off to NOPEville. In a nutshell, no one, I repeat, no one wants to be seen as clingy. <br/> However, nowadays people throw that word around too easily and sometimes people are wrongfully labelled clingy. Though, even if they’re really being clingy, it doesn’t always have to be such a bad thing. Here’s the reason why it’s totally okay to be clingy in a relationship: <br/> It’s normal and okay to want to spend a lot of time with your girlfriend/boyfriend/partner. <br/> When you really like someone, no matter at what stage of the relationship, there’s absolutely nothing wrong about wanting to be with the star of your dreams all the time. It’s in our human nature. It’s just as basic as feeling hungry and wanting food. <br/>  In most cases, the clingy lover is actually the lover whose needs aren’t met, who doesn’t feel appreciated in the relationship and that’s why it brings up insecurities and consequently, leads to attention-seeking behaviors. Inherently, it’s not the clingy lover that is wrong. It’s simply that their desires just aren’t reciprocated on the expected level. <br/> So instead of blaming yourself for 'being too much' and trying to fix what isn’t wrong in the first place, know that it’s okay to feel this way and communicate with your partner openly and honestly about your needs. <br/> Someone who complains you’re too clingy might well be just not that into you. <br/> Let’s stop for a second and ask yourself this: If you really, really like someone, would you be annoyed by this person wanting to be with you call it clingy, or would you wish to see them all the time and get jumpy and excited whenever you hear from them? <br/> I don’t know about you but I would be so damn happy and flattered if my crush was ever clingy to me! Even when I need my me time, because I like him so much, I wouldn’t react negatively to his desire to be with me no matter how intense (I wish, seriously!), or use it as a reason to break off. <br/> If someone breaks off with you because you’re too clingy, unless you’re at restraining-order-required level, sorry my dear, chances are high they’re already put off by other reasons and your clingy triple texts ain’t one. If anything, it’s probably just the last drop that makes the cup run over. <br/> If that’s how you love, then be it. <br/> Some might say clinginess comes from insecurities which means it needs to be fixed. However, for some people, it’s just who they are and the way they love. They need that much of attention and contact. They are that intense, that passionate, that crazy for love. So be it. <br/> There’s no shame in being true to yourself. Actually, you should be true to yourself all the time and embrace every ounce of that clinginess if there’s any. Just because someone doesn’t want you the same and thinks you’re being clingy doesn’t mean everyone agrees with that or there’s something wrong with you. <br/> To be fair, whether someone is clingy or not is totally relative. Do you know that clingy isn’t even a thing in some Eastern societies, for example Chinese or Vietnamese? These collectivist cultures don’t promote independence and so in relationships, couples stick together all the time and clingy is even what’s considered normal. <br/> There are people who want a clingy lover. <br/> Remember this: You’re not for everyone. You’re for the people who value you and appreciate you for everything you are including being clingy if that’s how you love. There are many, many people out there who would love to be with a clingy lover, who think your level of clinginess is absolutely healthy and normal and flattering. Don’t settle for less than that. Maybe you just haven’t found the right one yet. <br/> That being said, if you believe being clingy is in fact an indicator of a much deep-rooted emotional wound, or it has consistently posed a problem to all of your relationships or even your life, do look into it and make some changes, or even ask for help. This is the chance to learn more about yourself and find out what works best for you!"
		},
		{
			"section": "weddings",
			"type": "opinion",
			"title": "Weddings aren't a big deal.",
			"text": "Weddings are beautiful and special, but I personally don't see myself getting hyped over wearing an over-priced white gown and having 100 people witness me declare my love for someone. I wouldn't mind just having close family as witnesses and getting legally married in a courthouse. I wouldn't have to stress about showing off what I can buy for my wedding, wouldn't have to spend the first few years of my marriage paying off the wedding, etc. I've been to a few weddings and I think they're wonderful, but I don't see the point in spending so much and putting so much importance into a celebration that symbolizes the love when I can cherish the love itself."
		},
		{
			"section": "weddings",
			"type": "opinion",
			"title": "Wedding cake sucks",
			"text": "I don't need or want all this icing, the sponge is dominated by this sugary bullshit that makes me cringe to oblivion. Their should be a beauty in the simplicity of the cake not all this awful decorative shit which I'm not really sure is even edible added with the stupid amount of icing. Fuck you wedding cakes, I'd have plain sponge with some jam in the middle over you anytime."
		},
		{
			"section": "weddings",
			"type": "opinion",
			"title": "I don't like getting invited to weddings",
			"text": "I absolutely love weddings of people I'm close to, but there's very few of those. I hate getting invitations to weddings of people I just know, and don't speak to on an almost-daily basis. Even if I'm happy for them, it always feels awkward after the ceremony when I'm sitting at a table trying to eat a buffet with a room full of strangers. We all know weddings are so busy, so you barely get to see the bride and groom, and don't even get me started on the inconvenience of out of town weddings when it's not my best friend. I'm married myself, and absolutely loved my wedding, but had a guest list of 90 people, and only 10 of those were not related to myself or my husband, so I hope I didn't impose anyone to join my nuptials in an awkward 'not good enough to be besties, but rude to decline the invite' positon. (PS: This may not be an unpopular opinion for men, but literally every woman I've talked to LOVES weddings - even as a guest to a total stranger's wedding)"
		},
		{
			"section": "weddings",
			"type": "opinion",
			"title": "Non-virgins should not wear white on their wedding day",
			"text": "I was at a wedding for an aunt the other day, and I had this thought. She's been married twice before, and in between and before both marriages, she slept with dozens of men. I'm not bitter about her life choices, but I feel like the point of wearing white means that the person has remained 'spotless.' When they haven't, it feels like it sort of destroys the meaning."
		},
		{
			"section": "weddings",
			"type": "opinion",
			"title": "There's no such thing as a beautiful fat bride",
			"text": "A fat woman in a wedding dress is ugly. It looks like a beached albino whale.Most women strive to look their most beautiful on their wedding day, going all out by getting their hair, nails and make up professionally done, spending thousands an a beautiful dress, and trying to be in a peak physical condition. Even average sized women go on wedding diets. But it's like some fat women can't be bothered. It's not like their wedding day is a surprise, they have months and sometimes even a year or two to lose the fat, but no, they choose to stay fat for their wedding. Fine, it's their choice, but they can't expect people to just flat out lie to their faces and tell them how beautiful they are. I cringe every time I see a photo of a fat bride on social media and read the comments where people tell the bride how beautiful she looks. If a fat married woman eventually decides to change her life and lose the weight, she will forever have her ugly, fat wedding photos to look at."
		},
		{
			"section": "weddings",
			"type": "opinion",
			"title": "Weddings make me feel sick",
			"text": "So I have to go to my 'friends' wedding on Saturday and im already dreading it. I hate weddings. For a start this wedding is in a church and these people are not even religious so i have issues with that. It all seems so fake and contrived, its like they just wanna get married as they feel society has dictated that they should. And I'm already getting all the 'when are you going to get married?' bullsh*t, and then i have to explain my reasons why i dont ever want to get married and just end up looking and sounding like a miserable ba**ard because i dont want to 'follow the crowd' and conform to that lifestyle like everyone else around me seems to want to. I cant bail out of this one either, as they have already paid money for me (for the meal and crap like that) and i already bailed out of another friends weddings earlier this year, so i get the feeling people will think im jealous or something if i bail again. And because of this recent influx of wedding amongst people i know, three other 'friends' have announced that their jumping on the wedding bandwagon too, so ive got three more wedding to look forward too.I'm sure I'll get buried in this thread. But I haven't seen anyone mention the cake cutting (I guess that means my opinion must be really unpopular!). I like wedding cakes. I like eating them. I like marveling at the baker's craft. I don't like standing around in a crowd craning to watch the couple feed each other strictly for an outdated photo op. Then they do that awkward arm hook and freeze/hover while everyone and their dog snaps a photo. Oh gosh! Is he going to smash it in her face? Or will she do the smashing?! Cue laughter. Ugh. Same story, at every wedding ever."
		},
		{
			"section": "weddings",
			"type": "quote",
			"title": "Having a bunch of bridesmaids or a big wedding party looks extremely tacky.",
			"text": ""
		},
		{
			"section": "weddings",
			"type": "quote",
			"title": "Destination weddings are stupid.",
			"text": ""
		},
		{
			"section": "weddings",
			"type": "article",
			"title": "Weddings Are a Stupid Waste of Money",
			"text": "I’m usually not one to give Dr. Phil any credence; I hate that self-righteous, twangy, moustachioed cue-ball. But he did say one thing that struck me as genius. <br/> A woman on his show was pouring some huge amount of money into her wedding, and as a reason for this irresponsible, childish behavior, she said, “But I’ve always dreamed of my wedding.” <br/> “Well, I’ve always dreamed of playing in the NBA,” he told her, invoking his most patronizing sing-song so it sounded like enn-bee-aaaaay. “That doesn’t mean I get to suit up and play.” <br/> Point taken. When I was 9, I thought I was going to marry a horse, for heaven’s sake. (Wait. Actually, I kind of did that; my husband is 6”4.) Just because we were brainwashed into thinking a wedding is the ultimate entitlement doesn’t mean we have to act on it. <br/> I Learned Better the Second Time Around <br/> I’ve had two weddings. One cost about $20,000 and had 150 guests. It was really fun, and I cut a lot of corners and was proud of how little I (my parents) spent. The second time around, there was no way I was going to ask for their financial input yet again. The total cost was $6,000, it was just as fun, and we had the rest of our savings for the three months of unpaid leave I ended up having to take a few months later to care for our premature baby. <br/> Now, I realize putting those things in the same paragraph might seem unfair, but it’s actually the perfect way to illustrate what I am talking about. Because maybe you’re a bajillionaire with stacks of money placed together to form an end-table on which you have a lamp that burns $100 bills, in which case, go on with your bad self at Lake Como across from George Clooney. <br/> Or maybe you’re just a regular woman who really does have a secret desire for Your Day and you need to be talked down. So I’ll say it again: Because we kept the wedding to a reasonable party level, we had a big enough savings cushion to get us through the worst health crisis of our lives (we hope). <br/> And that is the correct priority to keep in mind when planning your wedding. <br/> It Was Not the Best Day of Our Lives<br/>Look, I get it. Any overhyped event can make you anxious enough to turn into a ‘zilla of some kind — I’ve known Prom-zillas, Christmas-zillas and even a Bris-zilla. You must resist the hype and focus on the fact that no matter how beautiful an event it is, it’s Just. One. Day. <br/> I don’t know if I speak for every wife when I say this, but honestly, when I look back on my wedding pictures, the main emotion I feel is incredulous — that my husband and I had no idea of the challenges we were facing, that we barely knew each other, that I wish I had professional portraits that weren’t so obviously bridal shots and oh my God, my dress was more low-cut than I realized. <br/> It was not the best day of our lives. It was an amazing party and probably the best day of our lives up till then, but we’ve had days since that blew that one out of the water. And some of them didn’t cost nothin’.  <br/> A Wedding Costs a House Down Payment <br/>Enough preaching. These are the numbers. According to CostOfWedding.com, which is produced by a market-research company collecting information for the wedding industry, the average wedding in the U.S. costs about $25,631, possibly more depending on where you live (here in the Bay Area, it goes up to more than $40,000). That is a down payment on a very nice house here — or the whole house, in large swaths of the country — and an amount many claim they just can’t manage to save up. <br/> So ask yourself: You want to take that amount and blow it on a one-day party, or you want to use it to create an investment that’ll end up paying your kids’ tuition if you play it right? And if your answer is the former, holy crap. Are you bipolar? <br/> The website goes on to list all the expenses you should take into account when planning a wedding. Things like gifts for the parents, wedding favors, a “traditional leather bound album” for the photos, flower-girl petals. According to the Association of Wedding Professionals, the wedding industry nets about $86 billion per year. That’s billion with a B. <br/> That is a lot of people counting on you getting starry-eyed about your wedding. Just like Las Vegas counts on chumps who think they’re going to beat the craps table, and the tobacco industry counts on weak-willed copycats who feel rebellious when they emulate Courtney Love. <br/> It’s an industry. It wants your money. Don’t give in to it. This idea that you deserve a wedding is not the point; of course you deserve a wonderful day. But what you deserve even more is financial security and a debt-free future. So plan a wedding based in reality, and who you are and what kind of wife you want to be: supportive, smart and with two feet firmly in reality. <br/> You’re not a princess, princess. You’re a smart cookie. Trust me, that’s so much better."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "Extra-marital affairs should be accepted by society",
			"text": "Sex is a fundamental human need. And for most marriages, when a woman is past the age of 35, her body and face's natural degradation, along with the toils of daily life, especially with kids, make her sexually unattractive. This is compounded by the fact that the husband has been too familiar with her body as to experience diminished marginal returns on sexual desire with her. Think about it, say you love Hamburgers, but if I feed you the same hamburger every day for 30 years, most of you will get tired of it. Put it in another way, no matter how hot you find a woman, you can be sure there's someone out there who is tired of fucking her. The above is no one's fault, it's just natural for men to desire and conquer multiple females, especially conquering other married females. This does not mean the man no longer loves his wife - he can go and fuck a new woman every week, and yet still provides for his family, spend his time with his wife and kids on the weekend watching tv, reading books, eating pizza, attending soccer games. He can still be emotionally available for the wife, and even fuck her to satisfy her needs. In other words, as long as his sexual adventures outside of marriage do not impact his ability to be a good husband, then that should be not be a problem. Why does 'body-unfaithfulness' have to mean 'mind-unfaithfulness'? In fact, I'd argue that 'mind-unfaithfulness' is even more dangerous - a man who never have sex with another woman but no longer feels any love for his wife. For full disclosure, I have, at any time, 3-4 sexual partners outside marriage, and most of those are also married (high school/college teachers, magazine editors, fashion designers, HR people, etc). They are all good wives with happy families but just looking to satisfy their natural biological needs. And likewise, I'm a loving husband and responsible father and both my kids and my wife love me. A plug is designed to plug into any compatible outlet."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "Only parents should have legal rights to marry.",
			"text": "Before any of you call me out, I'm talking about a legal marriage. Not religious one or spiritual interpersonal one. I don't see the point of a legal union of childless couples. The state should not be involved in this. It should however intervene when there are children that need to be raised. Here, the existing support should stay as it's necessary when there's a underage person involved."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "Only gay people should get married",
			"text": "Traditional marriage was a hedge: Women could not work and were therefore worthless past their childbearing years, 35+. Marriage was a hedge - a protection against a man leaving a woman when she got older, so the man couldn't leave her poor and helpless. Nowadays that women can work any job a man can and earn her own way, heterosexual marriage is pointless, at best (and detrimental in some ways). The only people who really value marriage are those whom it was traditionally denied to, homosexuals. My view is this: Heterosexual marriage is outdated, pointless, and detrimental. The only people who should get married are those who feel like they have something to prove, which is homosexuals presently."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "No man should ever fucking get married",
			"text": "What's the point? It's just meaningless symbolism and there are far more cons than pros. It's far more benefiting to women. It's essentially her retirement plan. I heard some drunk whore talking about how her man has millions of dollars and how she is going to get a million in alimony once it's over. And she's right, she will. Pay some bitch half of what you make . Nah fam, not me. Seriously , what's the point? Especially if you aren't religious , which most of you simps getting married aren't. I can do everything you can, minus the bullshit. Add in the fact that she will probably suck the dick of the manager of the pita pit in the bathroom while out with you and the kids and then kiss you afterwards ,and then going to see her lawyer while she is 'out with friends' to finalize the divorce papers, i see no upside. There is nothing beautiful about forcing yourself to spend your entire life with someone out of obligation. Nothing is permanent . Enjoy it while it's fun, and then move on. Everything shall pass."
		},		
		{
			"section": "marriage",
			"type": "opinion",
			"title": "Extremely attractive women are promiscuous, deceitful and cannot be trusted in a marriage.",
			"text": "This whole persona of an extremely beautiful, yet modest and humble woman is such a Hollywood illusion. In modern real life a woman who knows they hold such a power of beauty over men are master manipulators and will exploit their looks to their own advantage. I´m not saying they are bad people, humans are naturally selfish creatures and they are just being human. But if you are looking for loyalty, marry some ugly chick or stay single and save yourself the heartache. I know many will disagree with this statement, as I would have in the past. But one day the spell will be broken and you will realize that life is not a romantic comedy. Trust me."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "There is nothing wrong with marrying for wealth or status.",
			"text": "Marriage for love is a relatively modern idea in the Western world. Not very long ago, it was not uncommon for families to arrange marriages based on connections, education, social status, or who they thought would be the best provider for their daughters. Marriage was often like a business contract where families would join together and share certain benefits. Sure, a lot of things have changed, and we also no longer treat women like property or own slaves, etc. So naturally in a first world country where we all have the ability to live independently and earn money, it makes sense that marriage would only take place for reasons of being in love and wanting to spend life together. With that in mind, love is fickle and emotions come and go. Maintaining a healthy relationship takes commitment even when the times are tough and the love feels like it is draining. People change and go through difficult times. While people divorce for numerous reasons, financial reasons are often listed very high up as a big stressor in a marriage. People are always seeking security and while money can't buy happiness, there is little you can do with poverty, limited mobility, and a partner who squanders money and runs you into dept. People that marry for money may seem cold and unloving, but I believe they are being very practical. It's a fair transaction. They offer their partner companionship, sex, love - even if forced, family, and other potentially positive traits such as beauty, etc. and their partners, in return, provide them with security, a nice home, and a respectable place in the community. Since the 'golddigger' is not marrying for passion, they are more likely to make things work in a rational way and may actually be a better partner since they do not let their emotions rule them. In conclusion, I don't believe this situation works for everyone or that people should espouse this as an ideal. However, I see nothing wrong with people who choose to go this route and can understand why they would."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "The couple should come first, not the kids.",
			"text": "I cringe every time I hear a parent say 'my kids come first'. I mean, of course a parent should make sure to meet their kids basic needs. But when a couple sacrifices any kind of date nights or romance in order to put all the focus on the kids, they better not be surprised when their marriage falls apart. I mean, after the kids are grown and moved out, you won't have a marriage left if you put it on the back burner."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "Marriage is a scam",
			"text": "I think getting married, getting babies, and living happily ever after is an absurd goal. Marriage is a religious scam. It's an overrated thing."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "I think divorce outside very limited circumstances is wrong",
			"text": "Except in cases where there is genuine abuse (and I'm not talking about mild emotional 'abuse' that can occur in all relationships from time to time and is solvable by talking) I think its morally wrong to divorce, especially where children are involved. Some people say 'its better for the children not to see their parents fight' - but what would be even better is to see their parents work through it and not throw each other away as soon as they hit serious difficulties. What about adultery - I think adultery is seriously wrong, I think it should be grounds for divorce, but I still think its wrong to divorce in that case, plenty of people have worked through it and come out stronger the other side. When you marry someone you make them family. Family members don't abandon each other, they don't run away just because of conflict, they don't decide they're tired of one another because they don't feel excited any more. Family is composed of people you have an indissoluble bond to, either blood or marriage, and it's only because of the security of that indissolubility that it can fulfill it's function. When people treat spouses like consumer goods that can be bought and sold, traded in, thrown away according to whether or not right this instant they are making them 'happy' they lose the nature of the spousal relationship and the security it provides and the function that plays in the development and transmission of human culture. When you degrade marriage you're degrading society as a whole. Even in cases of abuse divorce is a terrible tragedy, but it's the abuser that broke the security in that case by abusing their spouse. Even then the ideal would be for the abuser to reform and the relationship to survive, but I recognize real life is often far from ideal."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "People get married because they don't love each other",
			"text": "People don't know what love is. That's why they get married and the guy buys an expensive ring and they have a fancy wedding and take pictures to post on social media and all that. All the theatrics are just cover up the lack of love between them. Love implies freedom. Giving the other person freedom to do and be whatever they want, but marriage restricts people to the point where they have to pretend they still love each other. If you get married and then stop finding your wife or husband attractive or whatever (which usually happens) you then have to pretend because that's supposedly better than getting a divorce, which is silly. That's why most couples have children, so that they can focus their attention on the child and not on their crumbling relationship. A lot of people will disagree, mainly because they are married or they plan on getting married in the future. But if you are really honest with yourself and if you observe other married people's relationship (maybe your parents'), you might realize that i'm not wrong. Real love is really rare in our society and if that kind of love was more common, this planet would be a paradise and there would be no need for marriage at all because it is unnecessary. And with no marriage, there would be no divorce."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "My current peeve: women changing names.",
			"text": "Lately so many people around me have been getting married and divorced. And with it comes all the work they put on everyone around them to deal with their name change. 'Teehee, I'm signing all my emails Firstname (formerly Maidenname) MARRIEDNAME!!’ And all the stupid commentary...'it's so weird that my name disappeared!' No it didn't, ho, when you get divorced it's still there and you'll be filling out paperwork using it for the rest of your life one way or the other. 'It's so annoying to apply to things now that I have to have so much extra paperwork to prove my name change!' No sympathy from me; that's just the penalty you pay for being self-obsessed in my opinion. I get it - in our society, women wind up with men's names one way or another. You get your dad's name, then swap it out for a husband's name. But I prefer simplicity and individuality, and all the people changing their names all the time makes everything a headache for everyone around them. No one gives a fuck that you got married or divorced. It's a little rude to make everyone around you relearn your name every time your relationship status changes. It seems like you're way too desperate for attention. Also, it just seems sad. You don't get to be an individual person anymore - having some dude's name put on you just feels like being marked as territory. It's gross. I can't help it, but I automatically lose respect for every woman I know who changes her name. I feel a bit like a bad feminist - it's her name and she can do what she wants with it - but name changes just gross me out so much that I can't help it. I deal with it by just ignoring name changes. Oh, I'll use the new name or whatever, but I don't remark on it and I don't bat an eye. You wanted attention? Sorry, but you'll have to find someone else to ooh and coo over your annoying feat of paperwork.Rant over."
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "Reason #376 to not get married....Your spouse can't kill you!",
			"text": "Every time I watch Dateline MSNBC I'm reminded that whenever someone is murdered the prime suspect is the spouse... And often the husband/wife really did do it. (For those not familiar Dateline is a show about real past murders and the court proceedings that occurred afterward) The couples are always attractive and the interviewed family members always remember how 'perfect ' they seemed from the outside. It never fails that in reality the marriage was in a shambles, one or both had been cheating for years, there was abuse, etc. So cheers everyone, to NOT getting killed by your spouse"
		},
		{
			"section": "marriage",
			"type": "opinion",
			"title": "Yes, my husband took my last name. There’s nothing wrong with it.",
			"text": "When two of my classmates heard me mention this morning that the guy I'm married to took my last name, they thought it was the funniest thing they'd ever heard of, and spent ten minutes cackling like hyenas. I wish I could say that's an unusual response, but I am freaking sick of the little snickers I hear from people when it comes up in conversation. Some things I've heard from these two just this morning: 'So who wears the pants?' We both do, obviously, unless I'm in a skirt or dress mood 'Why did you make him do that?' I don't make my partner do anything. He asked me… 'Why didn't you want his name?' Because I didn't. Apparently he didn't either. 'Well the girl I marry is going to take my name' Well, one day you'll maybe find a girl who can put up with your attitude, steal her heart, date her for years, convince her to marry you and take your name............and I still won't give a fuck about you or your marriage 'Does that make him your wife?!?' No, it makes him my partner who cares about my values and how I feel on certain things. There is a reason we use the word 'partner' instead of ‘husband/wife' 'That's really freaking weird' So is your sudden obsession with my life For crying out loud, mind your own fucking business."
		},
		{
			"section": "marriage",
			"type": "quote",
			"title": "Marriage is for everyone; it's just that people either marry the wrong person, are too selfish or unstable to be in a marriage",
			"text": ""
		},
		{
			"section": "marriage",
			"type": "quote",
			"title": "I just don't want to get married period. Never saw a problem with living in sin for the rest of my life.",
			"text": ""
		},
		{
			"section": "marriage",
			"type": "article",
			"title": "Marriage Will Never Be A Feminist Choice",
			"text": "A new study conducted by Facebook shows that younger women are opting not to take their husbands’ names in marriage. The statistics, which show that a third of all married women in their twenties chose to keep their own names, whereas only 12 percent of women in their 60s decided not to take their husbands’ name, have been hailed by some as a sign that younger women are 'embracing feminism.’ <br/> While I certainly support women who push back against this tradition, my elation with regard to this development is muted. Maybe fewer women are doing it, but many continue to take their husband’s name in marriage despite the fact that it’s no longer required. That women continue to do this voluntarily tells me that our concept of 'romance' and commitment are still firmly rooted in inequality. <br/> There are no persuasive arguments to defend the practice of taking on your husband's name in marriage. You just like the idea? Fine. Say what you mean –- your idea of romance is tied to symbols of submission. In many ways, we’re all susceptible to that. Hey, I made my first boyfriend buy me the tiniest diamond ring you could find (twice, in fact, as the first was lost in a tragic toilet-flushing accident) because I had internalized the silly notion that diamonds were connected to love and romance despite the ethical implications of diamonds. Say what you mean, and then question it. <br/> And to those who say it's 'less confusing' for the kids? Kids are not quite as dumb as you make them out to be. My mother kept her maiden name and somehow I managed to understand that she was my mom. Family pressuring you to follow tradition? Fine. I hear that. It’s hard to fight deeply ingrained family traditions. But that’s still about patriarchy. <br/> To me the name change issue is a moot point. It’s about patriarchy. Period. Just because we can make a choice about whether or not we want to buy into it doesn’t remove that reality. <br/> But I want to move beyond that conversation. To me the real question is: Why marry at all? <br/> Never in my life have I been interested in getting married. I’m interested in love, commitment, long-term relationships, and the sharing of dogs and groceries. What marriage has to do with any of that is lost on me. <br/> When I was younger and decidedly uncommitted, engaged in a series of one-night stands and regular booty calls and told people I didn't want to marry, they assumed it was because I was committed to singledom –- that I just wanted the freedom to fuck around for life. I was told I’d change my mind once I fell in love. <br/> But I did fall in love. A bunch of times. And still I found myself unable to find a convincing argument for marriage. 'Security,' said my mother. Security? But people cheat all the time. And 40% of marriages end in divorce, which strikes me as a particularly costly, time consuming, and exhausting way to break up. Break ups are almost always horrible, do I have to add lawyer fees to that? <br/> Marriage doesn’t guarantee your partner will with treat you with love, kindness, or respect for life. It doesn’t guarantee you safety, nor does it ensure your partner will support you or help with housework or childcare (in fact, marriage has long guaranteed pretty much the opposite). Marriage has been an institution within which women have suffered abuse, rape, murder and forced reproduction. It’s an institution that guaranteed men a maid and someone to bear and raise their offspring. <br/> The legal arguments don’t pan out for me either. In Canada, at least, being in a common law partnership guarantees couples the same rights and privileges marrieds are entitled to. It seems more productive and more progressive to fight for common law rights than it does to fight for an old, tired, regressive, and unnecessary institution such as marriage. What exactly are we trying to hang on to? <br/> I hadn't realized my anti-marriage position was such an abnormal thing until I hit my thirties and everyone around me started getting married. It seemed almost automatic, like an alarm went off: 'It’s time! It’s time! It’s time!' It was as though people didn’t even think about it –- marriage was just the 'natural' next step. <br/> It became apparent that, for most, marriage was an assumed part of their future so I started having the conversation with potential partners early on. <br/>'Just so you know, I don't want to get married or have babies,' I'd warn my dates over drinks. <br/>'Ever?' they'd ask, confused. <br/>'Well, no. Not ever. Unless you, like, need citizenship or something equally practical.'<br/> I’ve explained dozens of times over: 'Yes, I want a monogamous, love-type relationship. No, I don't see what marriage has to do with any of that.' The assumption that I simply didn’t want to commit confused me. 'I'd love a life partner, this is a political decision,' I’d clarify. I don't think it's a stretch to say that, for most men I've dated, I was the first woman they’d ever heard such a thing from. <br/> Women, in particular, are taught that a marriage proposal is something that validates them. It means they are desired -– that a man wants to 'lock it down.' And yes, I understand how a proposal could make one feel loved. And of course we all want to be loved. But is it so difficult to imagine that love can exist without diamonds and white dresses and an institution that made women into chattel? Things to be traded among men? Is it so difficult to imagine that people might commit to and love one another, just the same, without that piece of paper? <br/> It seems that if women were truly 'embracing feminism,' they’d reject such an unnecessary tradition so firmly rooted in sexist practices and ideas. While you can’t guarantee commitment or 'till death do us part,' you can guarantee is that marriage, over time, has harmed women more than it’s helped them. Rejecting marriage seems not only a political choice, but a practical one. And hey, you can still have a party."
		}

	]
}

